IDENTIFICATION DIVISION.
PROGRAM-ID. SUM-OF-NUMBERS.
AUTHOR. T SCHEMBRI.
DATE-WRITTEN. 07-31-2018.
DATE-COMPILED. 07-31-2018.

ENVIRONMENT DIVISION.

CONFIGURATION SECTION.
SOURCE-COMPUTER. VAX-PDP-11.
OBJECT-COMPUTER. VAX-PDP-11.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 TOTAL PIC 999999 VALUE 0.
01 COUNTER PIC 9999 VALUE 0.
01 MODULO PIC 9999.
01 TEMP PIC 9999.

PROCEDURE DIVISION.

PERFORM S VARYING COUNTER FROM 0 BY 1 UNTIL COUNTER=1000.
DISPLAY TOTAL.
STOP RUN.

S.
DIVIDE COUNTER BY 3 GIVING TEMP REMAINDER MODULO. 
IF 
    MODULO = 0 THEN ADD COUNTER TO TOTAL 
ELSE
    DIVIDE COUNTER BY 5 GIVING TEMP REMAINDER MODULO
    IF MODULO = 0 THEN ADD COUNTER TO TOTAL
END-IF.
